<template>
  <header-nav></header-nav>
  <div class="container">
    <div class="header-title"><h3>平台使用说明</h3></div>
    <a-divider style="margin-top: -5px"></a-divider>
    <div class="main">
      <div class="section">
        <h4>FAQ问答管理</h4>
        <h5>
          首页轮播图或导航栏处点击‘FAQ问答管理’即可进入操作页面，包含应用
          列表、FAQ问题列表、训练历史、流程列表、流程图等页面。
        </h5>
        <h5 v-for="(i, index) in list" :key="index">{{ i }}</h5>
      </div>
      <a-divider></a-divider>
       <div class="section">
        <h4>在线聊天机器人</h4>
        <h5>
          首页轮播图或导航栏处点击‘在线聊天机器人’即可进入操作页面。
        </h5>
        <h5 v-for="(i, index) in list2" :key="index">{{ i }}</h5>
      </div>
      <a-divider></a-divider>
       <div class="section">
        <h4>在线对话标注</h4>
        <h5>
          首页轮播图或导航栏处点击‘在线对话标注’即可进入操作页面，包含标
注数据列表和添加标注页面。

        </h5>
        <h5 v-for="(i, index) in list3" :key="index">{{ i }}</h5>
      </div>
    </div>
  </div>
</template>
<script>
import HeaderNav from "@/components/HeaderNav.vue";

export default {
  components: {
    HeaderNav,
  },
  setup() {
    let list = [
      "功能介绍：",
      "应用列表页面：",
      "1)	新增应用：输入应用信息，新建应用",
      "2)	编辑应用：更新应用信息",
      "3)	查看详情：点击按钮查看应用的问答列表和流程列表",
      "4)	删除应用",
      "问答列表页面：",
      "1)	新建标准问题：输入问题信息，新建问题",
      "2)	编辑标准问题：更新问题信息",
      "3)	上架/下架问题",
      "4)	删除问题",
      "5)	筛选问题：输入关键字，根据问题内容筛选问题",
      "6)	训练模型：使用现有问题列表训练",
      "7)	查看训练历史：点击‘训练记录’查看应用对应模型的训练状态",
      "8)	对话测试：点击‘对话测试’输入对话内容，获取测试回复",
      "9)	测试模型（待补充）",
      "10)	导入模型（待补充）",
      "11)	导出模型（待补充）",
      "流程列表页面：",
      "1)	新增流程：输入流程信息，新建流程",
      "2)	编辑流程：更新流程信息",
      "3)	删除流程",
      "4)	筛选流程：输入关键字，根据流程名称筛选流程",
      "5)	上架/下架流程",
      "6)	查看流程图：点击‘查看’显示流程图",
      "流程图页面：",
      "1)	新增流程节点：从左侧工具栏拖拽相应节点放入图中生成节点",
      "2)	新增边：点击输出端口拖出边，直到输入端口松开生成边",
      "3)	保存流程图",
      "4)	修改节点标签（待补充）",
      "5)	修改节点展示文本（待补充）",
      "6)	添加意图标签（待补充）",
      "对应后端接口地址：http://10.198.23.65:35000/",
    ];
    let list2 = [
  "功能介绍：",
	"在线聊天机器人页面：",
"1)	在线对话：输入对话内容，点击发送获取回复",
"2)	查看调试信息：打开调试开关，显示意图和槽位信息",
	"对应后端接口地址：http://10.198.21.8:36100/"

    ];
    let list3 = [
      "功能介绍：",
	"在线对话标注页面：",
"1)	添加标注数据：点击‘开始标注任务’，输入标注人员ID并点击确认，根据获取到的意图输入标注信息，点击‘添加标注’新增数据，而后点击‘获取意图’继续下一轮标注；点击‘清空’删除现有输入信息。",
"2)	删除标注数据 ",
"3)	筛选标注数据：输入标注人员ID，根据ID进行筛选",
	"对应后端接口地址：http://10.198.22.34:36000/"

    ]

    return {
      list,
      list2,
      list3
    };
  },
};
</script>

<style scoped>
.container {
  width: 1000px;
  background-color: rgb(247, 243, 243);
  margin: 0 auto 20px auto;
  padding: 20px 100px;
}
.header-title {
}
.main {
}
.section {
}
</style>